Infineon/amazon-freertos/vendors/infineon/XMCLib/2.2.0/CMSIS/Driver/Source/Config/XMC1400_Q48/RTE_Device.h
// <o>IRQ Priority <0-3>
// <i> Defines priority of UART events IRQ handling
// <i> Default: 3
#define RTE_UART0_IRQ_PRIORITY  3

//</e>

// <e> UART1 (Universal asynchronous receiver transmitter) [Driver_USART1]
// <i> Configuration settings for Driver_USART1 in component ::Drivers:UART
#define RTE_UART1                      0

//   <o> UART1_TX Pin <0=>P0_6 <1=>P0_7 <2=>P1_2 <3=>P1_3 <4=>P1_6 <5=>P2_10 <6=>P2_11
#define RTE_UART1_TX_ID                0

#if    (RTE_UART1_TX_ID == 0)
#define RTE_UART1_TX_PORT              P0_6
#define RTE_UART1_TX_AF                P0_6_AF_U0C1_DOUT0
#elif  (RTE_UART1_TX_ID == 1)
#define RTE_UART1_TX_PORT              P0_7
#define RTE_UART1_TX_AF                P0_7_AF_U0C1_DOUT0
#elif  (RTE_UART1_TX_ID == 2)
#define RTE_UART1_TX_PORT              P1_2
#define RTE_UART1_TX_AF                P1_2_AF_U0C1_DOUT0
#elif  (RTE_UART1_TX_ID == 3)
#define RTE_UART1_TX_PORT              P1_3
#define RTE_UART1_TX_AF                P1_3_AF_U0C1_DOUT0
#elif  (RTE_UART1_TX_ID == 4)
#define RTE_UART1_TX_PORT              P1_6
#define RTE_UART1_TX_AF                P1_6_AF_U0C1_DOUT0
#elif  (RTE_UART1_TX_ID == 5)
#define RTE_UART1_TX_PORT              P2_10
#define RTE_UART1_TX_AF                P2_10_AF_U0C1_DOUT0
#elif  (RTE_UART1_TX_ID == 6)
#define RTE_UART1_TX_PORT              P2_11
#define RTE_UART1_TX_AF                P2_11_AF_U0C1_DOUT0
#else
#error "Invalid UART1_TX Pin Configuration!"
#endif

//   <o> UART1_RX Pin <0=>P1_3 <1=>P1_2 <2=>P0_6 <3=>P0_7 <4=>P2_11 <5=>P2_10 <6=>P2_1
#define RTE_UART1_RX_ID                0

#if    (RTE_UART1_RX_ID == 0)
#define RTE_UART1_RX_PORT              P1_3
#define RTE_UART1_RX_INPUT             USIC0_C1_DX0_P1_3
#elif  (RTE_UART1_RX_ID == 1)
#define RTE_UART1_RX_PORT              P1_2
#define RTE_UART1_RX_INPUT             USIC0_C1_DX0_P1_2
#elif  (RTE_UART1_RX_ID == 2)
#define RTE_UART1_RX_PORT              P0_6
#define RTE_UART1_RX_INPUT             USIC0_C1_DX0_P0_6
#elif  (RTE_UART1_RX_ID == 3)
#define RTE_UART1_RX_PORT              P0_7
#define RTE_UART1_RX_INPUT             USIC0_C1_DX0_P0_7
#elif  (RTE_UART1_RX_ID == 4)
#define RTE_UART1_RX_PORT              P2_11
#define RTE_UART1_RX_INPUT             USIC0_C1_DX0_P2_11
#elif  (RTE_UART1_RX_ID == 5)
#define RTE_UART1_RX_PORT              P2_10
#define RTE_UART1_RX_INPUT             USIC0_C1_DX0_P2_10
#elif  (RTE_UART1_RX_ID == 6)
#define RTE_UART1_RX_PORT              P2_1
#define RTE_UART1_RX_INPUT             USIC0_C1_DX0_DX3INS
#else
#error "Invalid UART1_RX Pin Configuration!"
#endif

//   <o> UART1_RX FIFO ENTRIES <0=>0 <1=>2 <2=>4 <3=>8 <4=>16 <5=>32
#define RTE_UART1_RX_FIFO_SIZE_ID                4

#if    (RTE_UART1_RX_FIFO_SIZE_ID == 0)
#define RTE_UART1_RX_FIFO_SIZE         NO_FIFO
#define RTE_UART1_RX_FIFO_SIZE_NUM     0
#elif  (RTE_UART1_RX_FIFO_SIZE_ID == 1)
#define RTE_UART1_RX_FIFO_SIZE         FIFO_SIZE_2
#define RTE_UART1_RX_FIFO_SIZE_NUM     2
#elif  (RTE_UART1_RX_FIFO_SIZE_ID == 2)
#define RTE_UART1_RX_FIFO_SIZE         FIFO_SIZE_4
#define RTE_UART1_RX_FIFO_SIZE_NUM     4
#elif  (RTE_UART1_RX_FIFO_SIZE_ID == 3)
#define RTE_UART1_RX_FIFO_SIZE         FIFO_SIZE_8
#define RTE_UART1_RX_FIFO_SIZE_NUM     8
#elif  (RTE_UART1_RX_FIFO_SIZE_ID == 4)
#define RTE_UART1_RX_FIFO_SIZE         FIFO_SIZE_16
#define RTE_UART1_RX_FIFO_SIZE_NUM     16
#elif  (RTE_UART1_RX_FIFO_SIZE_ID == 5)
#define RTE_UART1_RX_FIFO_SIZE         FIFO_SIZE_32
#define RTE_UART1_RX_FIFO_SIZE_NUM     32
#else
#error "Invalid UART1_RX FIFO SIZE Configuration!"
#endif

//   <o> UART1_TX FIFO ENTRIES <0=>0 <1=>2 <2=>4 <3=>8 <4=>16 <5=>32
#define RTE_UART1_TX_FIFO_SIZE_ID                4

#if    (RTE_UART1_TX_FIFO_SIZE_ID == 0)
#define RTE_UART1_TX_FIFO_SIZE         NO_FIFO
#define RTE_UART1_TX_FIFO_SIZE_NUM     0
#elif  (RTE_UART1_TX_FIFO_SIZE_ID == 1)
#define RTE_UART1_TX_FIFO_SIZE         FIFO_SIZE_2
#define RTE_UART1_TX_FIFO_SIZE_NUM     2
#elif  (RTE_UART1_TX_FIFO_SIZE_ID == 2)
#define RTE_UART1_TX_FIFO_SIZE         FIFO_SIZE_4
#define RTE_UART1_TX_FIFO_SIZE_NUM     4
#elif  (RTE_UART1_TX_FIFO_SIZE_ID == 3)
#define RTE_UART1_TX_FIFO_SIZE         FIFO_SIZE_8
#define RTE_UART1_TX_FIFO_SIZE_NUM     8
#elif  (RTE_UART1_TX_FIFO_SIZE_ID == 4)
#define RTE_UART1_TX_FIFO_SIZE         FIFO_SIZE_16
#define RTE_UART1_TX_FIFO_SIZE_NUM     16
#elif  (RTE_UART1_TX_FIFO_SIZE_ID == 5)
#define RTE_UART1_TX_FIFO_SIZE         FIFO_SIZE_32
#define RTE_UART1_TX_FIFO_SIZE_NUM     32
#else
#error "Invalid UART1_TX FIFO SIZE Configuration!"
#endif

// <o>IRQ Priority <0-3>
// <i> Defines priority of UART events IRQ handling
// <i> Default: 3
#define RTE_UART1_IRQ_PRIORITY  3

// </e>
// <e> UART2 (Universal asynchronous receiver transmitter) [Driver_USART1]
// <i> Configuration settings for Driver_USART2 in component ::Drivers:UART
#define RTE_UART2                      0

//   <o> UART2_TX Pin <0=>P0_2 <1=>P0_3 <4=>P4_4 <5=>P4_5        
#define RTE_UART2_TX_ID                0

#if    (RTE_UART2_TX_ID == 0)
#define RTE_UART2_TX_PORT              P0_2
#define RTE_UART2_TX_AF                P0_2_AF_U1C0_DOUT0
#elif  (RTE_UART2_TX_ID == 1)
#define RTE_UART2_TX_PORT              P0_3
#define RTE_UART2_TX_AF                P0_3_AF_U1C0_DOUT0
#elif  (RTE_UART2_TX_ID == 4)
#define RTE_UART2_TX_PORT              P4_4
#define RTE_UART2_TX_AF                P4_4_AF_U1C0_DOUT0
#elif  (RTE_UART2_TX_ID == 5)
#define RTE_UART2_TX_PORT              P4_5
#define RTE_UART2_TX_AF                P4_5_AF_U1C0_DOUT0
#else
#error "Invalid UART2_TX Pin Configuration!"
#endif

//   <o> UART2_RX Pin <0=>P0_2 <1=>P0_3 <2=>P4_4 <3=>P4_5 <6=>P2_12
#define RTE_UART2_RX_ID                0

#if    (RTE_UART2_RX_ID == 0)
#define RTE_UART2_RX_PORT              P0_2
#define RTE_UART2_RX_INPUT             USIC1_C0_DX0_P0_2
#elif  (RTE_UART2_RX_ID == 1)
#define RTE_UART2_RX_PORT              P0_3
#define RTE_UART2_RX_INPUT             USIC1_C0_DX0_P0_3
#elif  (RTE_UART2_RX_ID == 2)
#define RTE_UART2_RX_PORT              P4_4
#define RTE_UART2_RX_INPUT             USIC1_C0_DX0_P4_4
#elif  (RTE_UART2_RX_ID == 3)
#define RTE_UART2_RX_PORT              P4_5
#define RTE_UART2_RX_INPUT             USIC1_C0_DX0_P4_5
#elif  (RTE_UART2_RX_ID == 6)
#define RTE_UART2_RX_PORT              P2_12
#define RTE_UART2_RX_INPUT             USIC1_C0_DX0_DX3INS
#else
#error "Invalid UART2_RX Pin Configuration!"
#endif

//   <o> UART2_RX FIFO ENTRIES <0=>0 <1=>2 <2=>4 <3=>8 <4=>16 <5=>32
#define RTE_UART2_RX_FIFO_SIZE_ID                4

#if    (RTE_UART2_RX_FIFO_SIZE_ID == 0)
#define RTE_UART2_RX_FIFO_SIZE         NO_FIFO
#define RTE_UART2_RX_FIFO_SIZE_NUM     0
#elif  (RTE_UART2_RX_FIFO_SIZE_ID == 1)
#define RTE_UART2_RX_FIFO_SIZE         FIFO_SIZE_2
#define RTE_UART2_RX_FIFO_SIZE_NUM     2
#elif  (RTE_UART2_RX_FIFO_SIZE_ID == 2)
#define RTE_UART2_RX_FIFO_SIZE         FIFO_SIZE_4
#define RTE_UART2_RX_FIFO_SIZE_NUM     4
#elif  (RTE_UART2_RX_FIFO_SIZE_ID == 3)
#define RTE_UART2_RX_FIFO_SIZE         FIFO_SIZE_8
#define RTE_UART2_RX_FIFO_SIZE_NUM     8
#elif  (RTE_UART2_RX_FIFO_SIZE_ID == 4)
#define RTE_UART2_RX_FIFO_SIZE         FIFO_SIZE_16
#define RTE_UART2_RX_FIFO_SIZE_NUM     16
#elif  (RTE_UART2_RX_FIFO_SIZE_ID == 5)
#define RTE_UART2_RX_FIFO_SIZE         FIFO_SIZE_32
#define RTE_UART2_RX_FIFO_SIZE_NUM     32
#else
#error "Invalid UART2_RX FIFO SIZE Configuration!"
#endif

//   <o> UART2_TX FIFO ENTRIES <0=>0 <1=>2 <2=>4 <3=>8 <4=>16 <5=>32
#define RTE_UART2_TX_FIFO_SIZE_ID                4

#if    (RTE_UART2_TX_FIFO_SIZE_ID == 0)
#define RTE_UART2_TX_FIFO_SIZE         NO_FIFO
#define RTE_UART2_TX_FIFO_SIZE_NUM     0
#elif  (RTE_UART2_TX_FIFO_SIZE_ID == 1)
#define RTE_UART2_TX_FIFO_SIZE         FIFO_SIZE_2
#define RTE_UART2_TX_FIFO_SIZE_NUM     2
#elif  (RTE_UART2_TX_FIFO_SIZE_ID == 2)
#define RTE_UART2_TX_FIFO_SIZE         FIFO_SIZE_4
#define RTE_UART2_TX_FIFO_SIZE_NUM     4
#elif  (RTE_UART2_TX_FIFO_SIZE_ID == 3)
#define RTE_UART2_TX_FIFO_SIZE         FIFO_SIZE_8
#define RTE_UART2_TX_FIFO_SIZE_NUM     8
#elif  (RTE_UART2_TX_FIFO_SIZE_ID == 4)
#define RTE_UART2_TX_FIFO_SIZE         FIFO_SIZE_16
#define RTE_UART2_TX_FIFO_SIZE_NUM     16
#elif  (RTE_UART2_TX_FIFO_SIZE_ID == 5)
#define RTE_UART2_TX_FIFO_SIZE         FIFO_SIZE_32
#define RTE_UART2_TX_FIFO_SIZE_NUM     32
#else
#error "Invalid UART2_TX FIFO SIZE Configuration!"
#endif

