Infineon/amazon-freertos/vendors/infineon/XMCLib/2.2.0/CMSIS/Driver/Source/Config/XMC1400_Q48/RTE_Device.h
// <o>IRQ Priority <0-3>
// <i> Defines priority of UART events IRQ handling
// <i> Default: 3
#define RTE_UART2_IRQ_PRIORITY  3

// </e>
// <e> UART3 (Universal asynchronous receiver transmitter) [Driver_USART1]
// <i> Configuration settings for Driver_USART3 in component ::Drivers:UART
#define RTE_UART3                      0

//   <o> UART3_TX Pin <0=>P0_0 <1=>P0_1 <2=>P2_12 <3=>P2_13 <4=>P3_0
#define RTE_UART3_TX_ID                0

#if    (RTE_UART3_TX_ID == 0)
#define RTE_UART3_TX_PORT              P0_0
#define RTE_UART3_TX_AF                P0_0_AF_U1C1_DOUT0
#elif  (RTE_UART3_TX_ID == 1)
#define RTE_UART3_TX_PORT              P0_1
#define RTE_UART3_TX_AF                P0_1_AF_U1C1_DOUT0
#elif  (RTE_UART3_TX_ID == 2)
#define RTE_UART3_TX_PORT              P2_12
#define RTE_UART3_TX_AF                P2_12_AF_U1C1_DOUT0
#elif  (RTE_UART3_TX_ID == 3)
#define RTE_UART3_TX_PORT              P2_13
#define RTE_UART3_TX_AF                P2_13_AF_U1C1_DOUT0
#elif  (RTE_UART3_TX_ID == 4)
#define RTE_UART3_TX_PORT              P3_0
#define RTE_UART3_TX_AF                P3_0_AF_U1C1_DOUT0
#else
#error "Invalid UART3_TX Pin Configuration!"
#endif

//   <o> UART3_RX Pin <0=>P0_0 <1=>P0_1 <2=>P2_12 <3=>P2_13 <4=>P3_0
#define RTE_UART3_RX_ID                0

#if    (RTE_UART3_RX_ID == 0)
#define RTE_UART3_RX_PORT              P0_0
#define RTE_UART3_RX_INPUT             USIC1_C1_DX0_P0_0
#elif  (RTE_UART3_RX_ID == 1)
#define RTE_UART3_RX_PORT              P0_1
#define RTE_UART3_RX_INPUT             USIC1_C1_DX0_P0_1
#elif  (RTE_UART3_RX_ID == 2)
#define RTE_UART3_RX_PORT              P2_12
#define RTE_UART3_RX_INPUT             USIC1_C1_DX0_P2_12
#elif  (RTE_UART3_RX_ID == 3)
#define RTE_UART3_RX_PORT              P2_13
#define RTE_UART3_RX_INPUT             USIC1_C1_DX0_P2_13
#elif  (RTE_UART3_RX_ID == 4)
#define RTE_UART3_RX_PORT              P3_0
#define RTE_UART3_RX_INPUT             USIC1_C1_DX0_P3_0
#else
#error "Invalid UART3_RX Pin Configuration!"
#endif

//   <o> UART3_RX FIFO ENTRIES <0=>0 <1=>2 <2=>4 <3=>8 <4=>16 <5=>32
#define RTE_UART3_RX_FIFO_SIZE_ID                4

#if    (RTE_UART3_RX_FIFO_SIZE_ID == 0)
#define RTE_UART3_RX_FIFO_SIZE         NO_FIFO
#define RTE_UART3_RX_FIFO_SIZE_NUM     0
#elif  (RTE_UART3_RX_FIFO_SIZE_ID == 1)
#define RTE_UART3_RX_FIFO_SIZE         FIFO_SIZE_2
#define RTE_UART3_RX_FIFO_SIZE_NUM     2
#elif  (RTE_UART3_RX_FIFO_SIZE_ID == 2)
#define RTE_UART3_RX_FIFO_SIZE         FIFO_SIZE_4
#define RTE_UART3_RX_FIFO_SIZE_NUM     4
#elif  (RTE_UART3_RX_FIFO_SIZE_ID == 3)
#define RTE_UART3_RX_FIFO_SIZE         FIFO_SIZE_8
#define RTE_UART3_RX_FIFO_SIZE_NUM     8
#elif  (RTE_UART3_RX_FIFO_SIZE_ID == 4)
#define RTE_UART3_RX_FIFO_SIZE         FIFO_SIZE_16
#define RTE_UART3_RX_FIFO_SIZE_NUM     16
#elif  (RTE_UART3_RX_FIFO_SIZE_ID == 5)
#define RTE_UART3_RX_FIFO_SIZE         FIFO_SIZE_32
#define RTE_UART3_RX_FIFO_SIZE_NUM     32
#else
#error "Invalid UART3_RX FIFO SIZE Configuration!"
#endif

//   <o> UART3_TX FIFO ENTRIES <0=>0 <1=>2 <2=>4 <3=>8 <4=>16 <5=>32
#define RTE_UART3_TX_FIFO_SIZE_ID                4

#if    (RTE_UART3_TX_FIFO_SIZE_ID == 0)
#define RTE_UART3_TX_FIFO_SIZE         NO_FIFO
#define RTE_UART3_TX_FIFO_SIZE_NUM     0
#elif  (RTE_UART3_TX_FIFO_SIZE_ID == 1)
#define RTE_UART3_TX_FIFO_SIZE         FIFO_SIZE_2
#define RTE_UART3_TX_FIFO_SIZE_NUM     2
#elif  (RTE_UART3_TX_FIFO_SIZE_ID == 2)
#define RTE_UART3_TX_FIFO_SIZE         FIFO_SIZE_4
#define RTE_UART3_TX_FIFO_SIZE_NUM     4
#elif  (RTE_UART3_TX_FIFO_SIZE_ID == 3)
#define RTE_UART3_TX_FIFO_SIZE         FIFO_SIZE_8
#define RTE_UART3_TX_FIFO_SIZE_NUM     8
#elif  (RTE_UART3_TX_FIFO_SIZE_ID == 4)
#define RTE_UART3_TX_FIFO_SIZE         FIFO_SIZE_16
#define RTE_UART3_TX_FIFO_SIZE_NUM     16
#elif  (RTE_UART3_TX_FIFO_SIZE_ID == 5)
#define RTE_UART3_TX_FIFO_SIZE         FIFO_SIZE_32
#define RTE_UART3_TX_FIFO_SIZE_NUM     32
#else
#error "Invalid UART3_TX FIFO SIZE Configuration!"
#endif

// <o>IRQ Priority <0-3>
// <i> Defines priority of UART events IRQ handling
// <i> Default: 3
#define RTE_UART3_IRQ_PRIORITY  3

// </e>

#define RTE_UART4                      0
#define RTE_UART5                      0

// <e> SPI0 (Serial peripheral interface) [Driver_SPI0]
// <i> Configuration settings for Driver_SPI0 in component ::Drivers:SPI
#define RTE_SPI0                      0

//   <o> SPI0 TX: MOSI(master) MISO(slave) Pin <0=>P0_14 <1=>P0_15 <2=>P1_0 <3=>P1_1 <4=>P1_5 <5=>P2_0 <6=>P2_1
#define RTE_SPI0_TX_ID                0

#if    (RTE_SPI0_TX_ID == 0)
#define RTE_SPI0_TX_PORT              P0_14
#define RTE_SPI0_TX_AF                P0_14_AF_U0C0_DOUT0
#elif  (RTE_SPI0_TX_ID == 1)
#define RTE_SPI0_TX_PORT              P0_15
#define RTE_SPI0_TX_AF                P0_15_AF_U0C0_DOUT0
#elif  (RTE_SPI0_TX_ID == 2)
#define RTE_SPI0_TX_PORT              P1_0
#define RTE_SPI0_TX_AF                P1_0_AF_U0C0_DOUT0
#elif  (RTE_SPI0_TX_ID == 3)
#define RTE_SPI0_TX_PORT              P1_1
#define RTE_SPI0_TX_AF                P1_1_AF_U0C0_DOUT0
#elif  (RTE_SPI0_TX_ID == 4)
#define RTE_SPI0_TX_PORT              P1_5
#define RTE_SPI0_TX_AF                P1_5_AF_U0C0_DOUT0
#elif  (RTE_SPI0_TX_ID == 5)
#define RTE_SPI0_TX_PORT              P2_0
#define RTE_SPI0_TX_AF                P2_0_AF_U0C0_DOUT0
#elif  (RTE_SPI0_TX_ID == 6)
#define RTE_SPI0_TX_PORT              P2_1
#define RTE_SPI0_TX_AF                P2_1_AF_U0C0_DOUT0
#else
#error "Invalid SPI0_TX Pin Configuration!"
#endif

//   <o> SPI0 RX MISO(master) MOSI(slave) Pin <0=>P0_14 <1=>P0_15 <2=>P1_0 <3=>P1_1 <4=>P2_0 <5=>P2_1
#define RTE_SPI0_RX_ID                0

#if    (RTE_SPI0_RX_ID == 0)
#define RTE_SPI0_RX_PORT              P0_14
#define RTE_SPI0_RX_INPUT             USIC0_C0_DX0_P0_14
#elif  (RTE_SPI0_RX_ID == 1)
#define RTE_SPI0_RX_PORT              P0_15
#define RTE_SPI0_RX_INPUT             USIC0_C0_DX0_P0_15
#elif  (RTE_SPI0_RX_ID == 2)
#define RTE_SPI0_RX_PORT              P1_0
#define RTE_SPI0_RX_INPUT             USIC0_C0_DX0_P1_0
#elif  (RTE_SPI0_RX_ID == 3)
#define RTE_SPI0_RX_PORT              P1_1
#define RTE_SPI0_RX_INPUT             USIC0_C0_DX0_P1_1
#elif  (RTE_SPI0_RX_ID == 4)
#define RTE_SPI0_RX_PORT              P2_0
#define RTE_SPI0_RX_INPUT             USIC0_C0_DX0_P2_0
#elif  (RTE_SPI0_RX_ID == 5)
#define RTE_SPI0_RX_PORT              P2_1
#define RTE_SPI0_RX_INPUT             USIC0_C0_DX0_P2_1
#else
#error "Invalid SPI0_RX Pin Configuration!"
#endif

//   <o> SPI0_CLK OUTPUT Pin <0=>P0_7 <1=>P0_8 <2=>P0_14 <3=>P1_6 <4=>P2_0
#define RTE_SPI0_CLK_OUTPUT_ID                0

