Infineon/amazon-freertos/vendors/infineon/XMCLib/2.2.0/CMSIS/Driver/Source/Config/XMC1400_Q48/RTE_Device.h
#define RTE_SPI1_SLAVE_SELECT_LINE_1_ID                0

#if    (RTE_SPI1_SLAVE_SELECT_LINE_1_ID == 0)
#define RTE_SPI1_SLAVE_SELECT_LINE_1_PORT              P0_10
#define RTE_SPI1_SLAVE_SELECT_LINE_1_AF                P0_10_AF_U0C1_SELO1
#elif  (RTE_SPI1_SLAVE_SELECT_LINE_1_ID == 1)
#define RTE_SPI1_SLAVE_SELECT_LINE_1_PORT              P1_4
#define RTE_SPI1_SLAVE_SELECT_LINE_1_AF                P1_4_AF_U0C1_SELO1
#else
#error "Invalid SPI1 SLAVE SELECT LINE 1 Pin Configuration!"
#endif
// </e>
// <e> SLAVE SELECT LINE 2
// <i> Enable slave select line 2
#define RTE_SPI1_SLAVE_SELECT_LINE2 0
//   <o> SPI1_SLAVE SELECT LINE 2 Pin <0=>P0_11 <1=>P1_5 

#define RTE_SPI1_SLAVE_SELECT_LINE_2_ID                0

#if    (RTE_SPI1_SLAVE_SELECT_LINE_2_ID == 0)
#define RTE_SPI1_SLAVE_SELECT_LINE_2_PORT              P0_11
#define RTE_SPI1_SLAVE_SELECT_LINE_2_AF                P0_11_AF_U0C1_SELO2
#elif  (RTE_SPI1_SLAVE_SELECT_LINE_2_ID == 1)
#define RTE_SPI1_SLAVE_SELECT_LINE_2_PORT              P1_5
#define RTE_SPI1_SLAVE_SELECT_LINE_2_AF                P1_5_AF_U0C1_SELO2
#else
#error "Invalid SPI1 SLAVE SELECT LINE 2 Pin Configuration!"
#endif
// </e>
// <e> SLAVE SELECT LINE 3
// <i> Enable slave select line 3
#define RTE_SPI1_SLAVE_SELECT_LINE3 0
//   <o> SPI1_SLAVE SELECT LINE 3 Pin <0=>P1_6

#define RTE_SPI1_SLAVE_SELECT_LINE_3_ID                0

#if    (RTE_SPI1_SLAVE_SELECT_LINE_3_ID == 0)
#define RTE_SPI1_SLAVE_SELECT_LINE_3_PORT              P1_6
#define RTE_SPI1_SLAVE_SELECT_LINE_3_AF                P1_6_AF_U0C1_SELO3
#else
#error "Invalid SPI1 SLAVE SELECT LINE 3 Pin Configuration!"
#endif

// </e>
// </h>

//   <o> SPI1_CLK INPUT Pin <0=>P1_3 <1=>P0_8 <2=>P0_7 <3=>P2_11 
  
#define RTE_SPI1_CLK_INPUT_ID                0

#if    (RTE_SPI1_CLK_INPUT_ID == 0)
#define RTE_SPI1_CLK_INPUT_PORT              P1_3
#define RTE_SPI1_CLK_INPUT                   USIC0_C1_DX1_P1_3
#elif  (RTE_SPI1_CLK_INPUT_ID == 1)
#define RTE_SPI1_CLK_INPUT_PORT              P0_8
#define RTE_SPI1_CLK_INPUT                   USIC0_C1_DX1_P0_8
#elif  (RTE_SPI1_CLK_INPUT_ID == 2)
#define RTE_SPI1_CLK_INPUT_PORT              P0_7
#define RTE_SPI1_CLK_INPUT                   USIC0_C1_DX1_P0_7
#elif  (RTE_SPI1_CLK_INPUT_ID == 3)
#define RTE_SPI1_CLK_INPUT_PORT              P2_11
#define RTE_SPI1_CLK_INPUT                   USIC0_C1_DX1_P2_11
#else
#error "Invalid SPI1 CLOCK INPUT Pin Configuration!"
#endif

//   <o> RTE_SPI1_SLAVE_SELECT INPUT Pin <0=>P0_0 <1=>P0_9 <2=>P0_10 <3=>P0_11 <4=>P1_1 <5=>P2_0

#define RTE_SPI1_SLAVE_SELECT_INPUT_ID                0

#if    (RTE_SPI1_SLAVE_SELECT_INPUT_ID == 0)
#define RTE_SPI1_SLAVE_SELECT_INPUT_PORT              P0_0
#define RTE_SPI1_SLAVE_SELECT_INPUT                   USIC0_C1_DX2_P0_0
#elif  (RTE_SPI1_SLAVE_SELECT_INPUT_ID == 1)
#define RTE_SPI1_SLAVE_SELECT_INPUT_PORT              P0_9
#define RTE_SPI1_SLAVE_SELECT_INPUT                   USIC0_C1_DX2_P0_9
#elif  (RTE_SPI1_SLAVE_SELECT_INPUT_ID == 2)
#define RTE_SPI1_SLAVE_SELECT_INPUT_PORT              P0_10
#define RTE_SPI1_SLAVE_SELECT_INPUT                   USIC0_C1_DX2_P0_10
#elif  (RTE_SPI1_SLAVE_SELECT_INPUT_ID == 3)
#define RTE_SPI1_SLAVE_SELECT_INPUT_PORT              P0_11
#define RTE_SPI1_SLAVE_SELECT_INPUT                   USIC0_C1_DX2_P0_11
#elif  (RTE_SPI1_SLAVE_SELECT_INPUT_ID == 4)
#define RTE_SPI1_SLAVE_SELECT_INPUT_PORT              P1_1
#define RTE_SPI1_SLAVE_SELECT_INPUT                   USIC0_C1_DX2_P1_1
#elif  (RTE_SPI1_SLAVE_SELECT_INPUT_ID == 5)
#define RTE_SPI1_SLAVE_SELECT_INPUT_PORT              P2_0
#define RTE_SPI1_SLAVE_SELECT_INPUT                   USIC0_C1_DX2_P2_0
#else
#error "Invalid SPI1 SLAVE SELECT INPUT Pin Configuration!"
#endif

//   <o> SPI1_RX FIFO ENTRIES <0=>0 <1=>2 <2=>4 <3=>8 <4=>16 <5=>32
#define RTE_SPI1_RX_FIFO_SIZE_ID                4

#if    (RTE_SPI1_RX_FIFO_SIZE_ID == 0)
#define RTE_SPI1_RX_FIFO_SIZE         NO_FIFO
#define RTE_SPI1_RX_FIFO_SIZE_NUM     0
#elif  (RTE_SPI1_RX_FIFO_SIZE_ID == 1)
#define RTE_SPI1_RX_FIFO_SIZE         FIFO_SIZE_2
#define RTE_SPI1_RX_FIFO_SIZE_NUM     2
#elif  (RTE_SPI1_RX_FIFO_SIZE_ID == 2)
#define RTE_SPI1_RX_FIFO_SIZE         FIFO_SIZE_4
#define RTE_SPI1_RX_FIFO_SIZE_NUM     4
#elif  (RTE_SPI1_RX_FIFO_SIZE_ID == 3)
#define RTE_SPI1_RX_FIFO_SIZE         FIFO_SIZE_8
#define RTE_SPI1_RX_FIFO_SIZE_NUM     8
#elif  (RTE_SPI1_RX_FIFO_SIZE_ID == 4)
#define RTE_SPI1_RX_FIFO_SIZE         FIFO_SIZE_16
#define RTE_SPI1_RX_FIFO_SIZE_NUM     16
#elif  (RTE_SPI1_RX_FIFO_SIZE_ID == 5)
#define RTE_SPI1_RX_FIFO_SIZE         FIFO_SIZE_32
#define RTE_SPI1_RX_FIFO_SIZE_NUM     32
#else
#error "Invalid SPI1_RX FIFO SIZE Configuration!"
#endif

//   <o> SPI1_TX FIFO ENTRIES <0=>0 <1=>2 <2=>4 <3=>8 <4=>16 <5=>32
#define RTE_SPI1_TX_FIFO_SIZE_ID                4

#if    (RTE_SPI1_TX_FIFO_SIZE_ID == 0)
#define RTE_SPI1_TX_FIFO_SIZE         NO_FIFO
#define RTE_SPI1_TX_FIFO_SIZE_NUM     0
#elif  (RTE_SPI1_TX_FIFO_SIZE_ID == 1)
#define RTE_SPI1_TX_FIFO_SIZE         FIFO_SIZE_2
#define RTE_SPI1_TX_FIFO_SIZE_NUM     2
#elif  (RTE_SPI1_TX_FIFO_SIZE_ID == 2)
#define RTE_SPI1_TX_FIFO_SIZE         FIFO_SIZE_4
#define RTE_SPI1_TX_FIFO_SIZE_NUM     4
#elif  (RTE_SPI1_TX_FIFO_SIZE_ID == 3)
#define RTE_SPI1_TX_FIFO_SIZE         FIFO_SIZE_8
#define RTE_SPI1_TX_FIFO_SIZE_NUM     8
#elif  (RTE_SPI1_TX_FIFO_SIZE_ID == 4)
#define RTE_SPI1_TX_FIFO_SIZE         FIFO_SIZE_16
#define RTE_SPI1_TX_FIFO_SIZE_NUM     16
#elif  (RTE_SPI1_TX_FIFO_SIZE_ID == 5)
#define RTE_SPI1_TX_FIFO_SIZE         FIFO_SIZE_32
#define RTE_SPI1_TX_FIFO_SIZE_NUM     32
#else
#error "Invalid SPI1_TX FIFO SIZE Configuration!"
#endif

// <o>IRQ Priority <0-3>
// <i> Defines priority of SPI events IRQ handling
// <i> Default: 3
#define RTE_SPI1_IRQ_PRIORITY  3

//</e>
// <e> SPI2 (Serial peripheral interface) [Driver_SPI2]
// <i> Configuration settings for Driver_SPI2 in component ::Drivers:SPI
#define RTE_SPI2                      0

//   <o> SPI2 TX MOSI(master) MISO(slave) Pin <0=>P0_2 <1=>P0_3 <4=>P4_4 <5=>P4_5        
#define RTE_SPI2_TX_ID                0

#if    (RTE_SPI2_TX_ID == 0)
#define RTE_SPI2_TX_PORT              P0_2
#define RTE_SPI2_TX_AF                P0_2_AF_U1C0_DOUT0
#elif  (RTE_SPI2_TX_ID == 1)
#define RTE_SPI2_TX_PORT              P0_3
#define RTE_SPI2_TX_AF                P0_3_AF_U1C0_DOUT0
#elif  (RTE_SPI2_TX_ID == 4)
#define RTE_SPI2_TX_PORT              P4_4
#define RTE_SPI2_TX_AF                P4_4_AF_U1C0_DOUT0
#elif  (RTE_SPI2_TX_ID == 5)
#define RTE_SPI2_TX_PORT              P4_5
#define RTE_SPI2_TX_AF                P4_5_AF_U1C0_DOUT0
#else
#error "Invalid SPI2_TX Pin Configuration!"
#endif

//   <o> SPI2 RX MISO(master) MOSI(slave) Pin <0=>P0_2 <1=>P0_3 <2=>P4_4 <3=>P4_5
#define RTE_SPI2_RX_ID                0

#if    (RTE_SPI2_RX_ID == 0)
#define RTE_SPI2_RX_PORT              P0_2
#define RTE_SPI2_RX_INPUT             USIC1_C0_DX0_P0_2
#elif  (RTE_SPI2_RX_ID == 1)
#define RTE_SPI2_RX_PORT              P0_3
#define RTE_SPI2_RX_INPUT             USIC1_C0_DX0_P0_3
#elif  (RTE_SPI2_RX_ID == 2)
#define RTE_SPI2_RX_PORT              P4_4
#define RTE_SPI2_RX_INPUT             USIC1_C0_DX0_P4_4
#elif  (RTE_SPI2_RX_ID == 3)
#define RTE_SPI2_RX_PORT              P4_5
#define RTE_SPI2_RX_INPUT             USIC1_C0_DX0_P4_5
#else
#error "Invalid SPI2_RX Pin Configuration!"
#endif

//   <o> SPI2_CLK OUTPUT Pin <0=>P0_2 <1=>P2_12 <5=>P4_5 <6=>P4_6
#define RTE_SPI2_CLK_OUTPUT_ID                0
#if    (RTE_SPI2_CLK_OUTPUT_ID == 0)
#define RTE_SPI2_CLK_OUTPUT_PORT              P0_2
#define RTE_SPI2_CLK_AF                       P0_2_AF_U1C0_SCLKOUT
#elif  (RTE_SPI2_CLK_OUTPUT_ID == 1)
#define RTE_SPI2_CLK_OUTPUT_PORT              P2_12
#define RTE_SPI2_CLK_AF                       P2_12_AF_U1C0_SCLKOUT
#elif  (RTE_SPI2_CLK_OUTPUT_ID == 5)
#define RTE_SPI2_CLK_OUTPUT_PORT              P4_5
#define RTE_SPI2_CLK_AF                       P4_5_AF_U1C0_SCLKOUT
#elif  (RTE_SPI2_CLK_OUTPUT_ID == 6)
#define RTE_SPI2_CLK_OUTPUT_PORT              P4_6
#define RTE_SPI2_CLK_AF                       P4_6_AF_U1C0_SCLKOUT
#else
#error "Invalid SPI2 CLOCK OUTPUT Pin Configuration!"
#endif

//   <h> SPI2_SLAVE SELECT Pins 
// <e> SLAVE SELECT LINE 0
// <i> Enable slave select line 0
#define RTE_SPI2_SLAVE_SELECT_LINE0 0
//   <o> SPI2_SLAVE SELECT LINE 0 Pin <0=>P4_7
#define RTE_SPI2_SLAVE_SELECT_LINE_0_ID                0
#if    (RTE_SPI2_SLAVE_SELECT_LINE_0_ID == 0)
#define RTE_SPI2_SLAVE_SELECT_LINE_0_PORT              P4_7
#define RTE_SPI2_SLAVE_SELECT_LINE_0_AF                P4_7_AF_U1C0_SELO0
#else
#error "Invalid SPI2 SLAVE SELECT LINE 0 Pin Configuration!"
#endif
// </e>
// <e> SLAVE SELECT LINE 1
// <i> Enable slave select line 1
#define RTE_SPI2_SLAVE_SELECT_LINE1 0
//   <o> SPI2_SLAVE SELECT LINE 1 Pin <0=>P3_0
#define RTE_SPI2_SLAVE_SELECT_LINE_1_ID                0
#if    (RTE_SPI2_SLAVE_SELECT_LINE_1_ID == 0)
#define RTE_SPI2_SLAVE_SELECT_LINE_1_PORT              P3_0
#define RTE_SPI2_SLAVE_SELECT_LINE_1_AF                P3_0_AF_U1C0_SELO1
#else
#error "Invalid SPI2 SLAVE SELECT LINE 1 Pin Configuration!"
#endif
// </e>

