Infineon/amazon-freertos/vendors/infineon/XMCLib/2.2.0/CMSIS/Driver/Source/Config/XMC1400_Q48/RTE_Device.h
#define RTE_SPI2_SLAVE_SELECT_LINE2 0

#define RTE_SPI2_SLAVE_SELECT_LINE3 0

#define RTE_SPI2_SLAVE_SELECT_LINE4 0
// </h>

//   <o> SPI2_CLK INPUT Pin <0=>P0_2 <2=>P4_5 <3=>P4_6
#define RTE_SPI2_CLK_INPUT_ID                0
#if    (RTE_SPI2_CLK_INPUT_ID == 0)
#define RTE_SPI2_CLK_INPUT_PORT              P0_2
#define RTE_SPI2_CLK_INPUT                   USIC1_C0_DX1_P0_2
#elif  (RTE_SPI2_CLK_INPUT_ID == 2)
#define RTE_SPI2_CLK_INPUT_PORT              P4_5
#define RTE_SPI2_CLK_INPUT                   USIC1_C0_DX1_P4_5
#elif  (RTE_SPI2_CLK_INPUT_ID == 3)
#define RTE_SPI2_CLK_INPUT_PORT              P4_6
#define RTE_SPI2_CLK_INPUT                   USIC1_C0_DX1_P4_6
#else
#error "Invalid SPI2 CLOCK INPUT Pin Configuration!"
#endif

//   <o> RTE_SPI2_SLAVE_SELECT INPUT Pin <0=>P4_7
#define RTE_SPI2_SLAVE_SELECT_INPUT_ID                0
#if    (RTE_SPI2_SLAVE_SELECT_INPUT_ID == 0)
#define RTE_SPI2_SLAVE_SELECT_INPUT_PORT              P4_7
#define RTE_SPI2_SLAVE_SELECT_INPUT                   USIC1_C0_DX2_P4_7
#else
#error "Invalid SPI2 SLAVE SELECT INPUT Pin Configuration!"
#endif

//   <o> SPI2_RX FIFO ENTRIES <0=>0 <1=>2 <2=>4 <3=>8 <4=>16 <5=>32
#define RTE_SPI2_RX_FIFO_SIZE_ID                4
#if    (RTE_SPI2_RX_FIFO_SIZE_ID == 0)
#define RTE_SPI2_RX_FIFO_SIZE         NO_FIFO
#define RTE_SPI2_RX_FIFO_SIZE_NUM     0
#elif  (RTE_SPI2_RX_FIFO_SIZE_ID == 1)
#define RTE_SPI2_RX_FIFO_SIZE         FIFO_SIZE_2
#define RTE_SPI2_RX_FIFO_SIZE_NUM     2
#elif  (RTE_SPI2_RX_FIFO_SIZE_ID == 2)
#define RTE_SPI2_RX_FIFO_SIZE         FIFO_SIZE_4
#define RTE_SPI2_RX_FIFO_SIZE_NUM     4
#elif  (RTE_SPI2_RX_FIFO_SIZE_ID == 3)
#define RTE_SPI2_RX_FIFO_SIZE         FIFO_SIZE_8
#define RTE_SPI2_RX_FIFO_SIZE_NUM     8
#elif  (RTE_SPI2_RX_FIFO_SIZE_ID == 4)
#define RTE_SPI2_RX_FIFO_SIZE         FIFO_SIZE_16
#define RTE_SPI2_RX_FIFO_SIZE_NUM     16
#elif  (RTE_SPI2_RX_FIFO_SIZE_ID == 5)
#define RTE_SPI2_RX_FIFO_SIZE         FIFO_SIZE_32
#define RTE_SPI2_RX_FIFO_SIZE_NUM     32
#else
#error "Invalid SPI2_RX FIFO SIZE Configuration!"
#endif

//   <o> SPI2_TX FIFO ENTRIES <0=>0 <1=>2 <2=>4 <3=>8 <4=>16 <5=>32
#define RTE_SPI2_TX_FIFO_SIZE_ID                4
#if    (RTE_SPI2_TX_FIFO_SIZE_ID == 0)
#define RTE_SPI2_TX_FIFO_SIZE         NO_FIFO
#define RTE_SPI2_TX_FIFO_SIZE_NUM     0
#elif  (RTE_SPI2_TX_FIFO_SIZE_ID == 1)
#define RTE_SPI2_TX_FIFO_SIZE         FIFO_SIZE_2
#define RTE_SPI2_TX_FIFO_SIZE_NUM     2
#elif  (RTE_SPI2_TX_FIFO_SIZE_ID == 2)
#define RTE_SPI2_TX_FIFO_SIZE         FIFO_SIZE_4
#define RTE_SPI2_TX_FIFO_SIZE_NUM     4
#elif  (RTE_SPI2_TX_FIFO_SIZE_ID == 3)
#define RTE_SPI2_TX_FIFO_SIZE         FIFO_SIZE_8
#define RTE_SPI2_TX_FIFO_SIZE_NUM     8
#elif  (RTE_SPI2_TX_FIFO_SIZE_ID == 4)
#define RTE_SPI2_TX_FIFO_SIZE         FIFO_SIZE_16
#define RTE_SPI2_TX_FIFO_SIZE_NUM     16
#elif  (RTE_SPI2_TX_FIFO_SIZE_ID == 5)
#define RTE_SPI2_TX_FIFO_SIZE         FIFO_SIZE_32
#define RTE_SPI2_TX_FIFO_SIZE_NUM     32
#else
#error "Invalid SPI2_TX FIFO SIZE Configuration!"
#endif

// <o>IRQ Priority <0-3>
// <i> Defines priority of SPI events IRQ handling
// <i> Default: 3
#define RTE_SPI2_IRQ_PRIORITY  3

//</e>
// <e> SPI3 (Serial peripheral interface) [Driver_SPI3]
// <i> Configuration settings for Driver_SPI3 in component ::Drivers:SPI
#define RTE_SPI3                      0

//   <o> SPI3 TX MOSI(master) MISO(slave) Pin <0=>P0_0 <1=>P0_1 <2=>P2_12 <3=>P2_13 <4=>P3_0
#define RTE_SPI3_TX_ID                0

#if    (RTE_SPI3_TX_ID == 0)
#define RTE_SPI3_TX_PORT              P0_0
#define RTE_SPI3_TX_AF                P0_0_AF_U1C1_DOUT0
#elif  (RTE_SPI3_TX_ID == 1)
#define RTE_SPI3_TX_PORT              P0_1
#define RTE_SPI3_TX_AF                P0_1_AF_U1C1_DOUT0
#elif  (RTE_SPI3_TX_ID == 2)
#define RTE_SPI3_TX_PORT              P2_12
#define RTE_SPI3_TX_AF                P2_12_AF_U1C1_DOUT0
#elif  (RTE_SPI3_TX_ID == 3)
#define RTE_SPI3_TX_PORT              P2_13
#define RTE_SPI3_TX_AF                P2_13_AF_U1C1_DOUT0
#elif  (RTE_SPI3_TX_ID == 4)
#define RTE_SPI3_TX_PORT              P3_0
#define RTE_SPI3_TX_AF                P3_0_AF_U1C1_DOUT0
#else
#error "Invalid SPI3_TX Pin Configuration!"
#endif

//   <o> SPI3 RX MISO(master) MOSI(slave)Pin <0=>P0_0 <1=>P0_1 <2=>P2_12 <3=>P2_13 <4=>P3_0
#define RTE_SPI3_RX_ID                0

#if    (RTE_SPI3_RX_ID == 0)
#define RTE_SPI3_RX_PORT              P0_0
#define RTE_SPI3_RX_INPUT             USIC1_C1_DX0_P0_0
#elif  (RTE_SPI3_RX_ID == 1)
#define RTE_SPI3_RX_PORT              P0_1
#define RTE_SPI3_RX_INPUT             USIC1_C1_DX0_P0_1
#elif  (RTE_SPI3_RX_ID == 2)
#define RTE_SPI3_RX_PORT              P2_12
#define RTE_SPI3_RX_INPUT             USIC1_C1_DX0_P2_12
#elif  (RTE_SPI3_RX_ID == 3)
#define RTE_SPI3_RX_PORT              P2_13
#define RTE_SPI3_RX_INPUT             USIC1_C1_DX0_P2_13
#elif  (RTE_SPI3_RX_ID == 4)
#define RTE_SPI3_RX_PORT              P3_0
#define RTE_SPI3_RX_INPUT             USIC1_C1_DX0_P3_0
#else
#error "Invalid SPI3_RX Pin Configuration!"
#endif

//   <o> SPI3_CLK OUTPUT Pin <0=>P0_1 <1=>P0_3 <2=>P2_12 <4=>P3_0
#define RTE_SPI3_CLK_OUTPUT_ID                0
#if    (RTE_SPI3_CLK_OUTPUT_ID == 0)
#define RTE_SPI3_CLK_OUTPUT_PORT              P0_1
#define RTE_SPI3_CLK_AF                       P0_1_AF_U1C1_SCLKOUT
#elif  (RTE_SPI3_CLK_OUTPUT_ID == 1)
#define RTE_SPI3_CLK_OUTPUT_PORT              P0_3
#define RTE_SPI3_CLK_AF                       P0_3_AF_U1C1_SCLKOUT
#elif  (RTE_SPI3_CLK_OUTPUT_ID == 2)
#define RTE_SPI3_CLK_OUTPUT_PORT              P2_12
#define RTE_SPI3_CLK_AF                       P2_12_AF_U1C1_SCLKOUT
#elif  (RTE_SPI3_CLK_OUTPUT_ID == 4)
#define RTE_SPI3_CLK_OUTPUT_PORT              P3_0
#define RTE_SPI3_CLK_AF                       P3_0_AF_U1C1_SCLKOUT
#else
#error "Invalid SPI3 CLOCK OUTPUT Pin Configuration!"
#endif

//   <h> SPI3_SLAVE SELECT Pins 
// <e> SLAVE SELECT LINE 0
// <i> Enable slave select line 0
#define RTE_SPI3_SLAVE_SELECT_LINE0 0
//   <o> SPI3_SLAVE SELECT LINE 0 Pin <0=>P0_4
#define RTE_SPI3_SLAVE_SELECT_LINE_0_ID                0
#if    (RTE_SPI3_SLAVE_SELECT_LINE_0_ID == 0)
#define RTE_SPI3_SLAVE_SELECT_LINE_0_PORT              P0_4
#define RTE_SPI3_SLAVE_SELECT_LINE_0_AF                P0_4_AF_U1C1_SELO0
#else
#error "Invalid SPI3 SLAVE SELECT LINE 0 Pin Configuration!"
#endif
// </e>

#define RTE_SPI3_SLAVE_SELECT_LINE1 0

