Infineon/amazon-freertos/vendors/infineon/XMCLib/2.2.0/CMSIS/Driver/Source/Config/XMC1400_Q48/RTE_Device.h
// <o>IRQ Priority <0-3>
// <i> Defines priority of I2C events IRQ handling
// <i> Default: 3
#define RTE_I2C1_IRQ_PRIORITY  3

// <o>Hold Delay <0-15>
// <i> Defines the delay used to respect the SDA hold time
// <i> Default: 0
#define RTE_I2C1_HDEL  0

//</e>
// <e> I2C2 (Serial peripheral interface) [Driver_I2C2]
// <i> Configuration settings for Driver_I2C2 in component ::Drivers:I2C
#define RTE_I2C2                      0

//   <o> I2C2_TX Pin <0=>P0_2 <1=>P0_3 <4=>P4_4 <5=>P4_5        
#define RTE_I2C2_TX_ID                0

#if    (RTE_I2C2_TX_ID == 0)
#define RTE_I2C2_TX_PORT              P0_2
#define RTE_I2C2_TX_AF                P0_2_AF_U1C0_DOUT0
#elif  (RTE_I2C2_TX_ID == 1)
#define RTE_I2C2_TX_PORT              P0_3
#define RTE_I2C2_TX_AF                P0_3_AF_U1C0_DOUT0
#elif  (RTE_I2C2_TX_ID == 4)
#define RTE_I2C2_TX_PORT              P4_4
#define RTE_I2C2_TX_AF                P4_4_AF_U1C0_DOUT0
#elif  (RTE_I2C2_TX_ID == 5)
#define RTE_I2C2_TX_PORT              P4_5
#define RTE_I2C2_TX_AF                P4_5_AF_U1C0_DOUT0
#else
#error "Invalid I2C2_TX Pin Configuration!"
#endif

//   <o> I2C2_RX Pin <0=>P0_2 <1=>P0_3 <2=>P4_4 <3=>P4_5
#define RTE_I2C2_RX_ID                0

#if    (RTE_I2C2_RX_ID == 0)
#define RTE_I2C2_RX_PORT              P0_2
#define RTE_I2C2_RX_INPUT             USIC1_C0_DX0_P0_2
#elif  (RTE_I2C2_RX_ID == 1)
#define RTE_I2C2_RX_PORT              P0_3
#define RTE_I2C2_RX_INPUT             USIC1_C0_DX0_P0_3
#elif  (RTE_I2C2_RX_ID == 2)
#define RTE_I2C2_RX_PORT              P4_4
#define RTE_I2C2_RX_INPUT             USIC1_C0_DX0_P4_4
#elif  (RTE_I2C2_RX_ID == 3)
#define RTE_I2C2_RX_PORT              P4_5
#define RTE_I2C2_RX_INPUT             USIC1_C0_DX0_P4_5
#else
#error "Invalid I2C2_RX Pin Configuration!"
#endif

//   <o> I2C2_CLK OUTPUT Pin <0=>P0_2 <1=>P2_12 <5=>P4_5 <6=>P4_6
#define RTE_I2C2_CLK_OUTPUT_ID                0
#if    (RTE_I2C2_CLK_OUTPUT_ID == 0)
#define RTE_I2C2_CLK_OUTPUT_PORT              P0_2
#define RTE_I2C2_CLK_AF                       P0_2_AF_U1C0_SCLKOUT
#elif  (RTE_I2C2_CLK_OUTPUT_ID == 1)
#define RTE_I2C2_CLK_OUTPUT_PORT              P2_12
#define RTE_I2C2_CLK_AF                       P2_12_AF_U1C0_SCLKOUT
#elif  (RTE_I2C2_CLK_OUTPUT_ID == 5)
#define RTE_I2C2_CLK_OUTPUT_PORT              P4_5
#define RTE_I2C2_CLK_AF                       P4_5_AF_U1C0_SCLKOUT
#elif  (RTE_I2C2_CLK_OUTPUT_ID == 6)
#define RTE_I2C2_CLK_OUTPUT_PORT              P4_6
#define RTE_I2C2_CLK_AF                       P4_6_AF_U1C0_SCLKOUT
#else
#error "Invalid I2C2 CLOCK OUTPUT Pin Configuration!"
#endif

//   <o> I2C2_CLK INPUT Pin <0=>P0_2 <2=>P4_5 <3=>P4_6
#define RTE_I2C2_CLK_INPUT_ID                0
#if    (RTE_I2C2_CLK_INPUT_ID == 0)
#define RTE_I2C2_CLK_INPUT_PORT              P0_2
#define RTE_I2C2_CLK_INPUT                   USIC1_C0_DX1_P0_2
#elif  (RTE_I2C2_CLK_INPUT_ID == 2)
#define RTE_I2C2_CLK_INPUT_PORT              P4_5
#define RTE_I2C2_CLK_INPUT                   USIC1_C0_DX1_P4_5
#elif  (RTE_I2C2_CLK_INPUT_ID == 3)
#define RTE_I2C2_CLK_INPUT_PORT              P4_6
#define RTE_I2C2_CLK_INPUT                   USIC1_C0_DX1_P4_6
#else
#error "Invalid I2C2 CLOCK INPUT Pin Configuration!"
#endif

//   <o> I2C2_RX FIFO ENTRIES <0=>0 <1=>2 <2=>4 <3=>8 <4=>16 <5=>32
#define RTE_I2C2_RX_FIFO_SIZE_ID                4
#if    (RTE_I2C2_RX_FIFO_SIZE_ID == 0)
#define RTE_I2C2_RX_FIFO_SIZE         NO_FIFO
#define RTE_I2C2_RX_FIFO_SIZE_NUM     0
#elif  (RTE_I2C2_RX_FIFO_SIZE_ID == 1)
#define RTE_I2C2_RX_FIFO_SIZE         FIFO_SIZE_2
#define RTE_I2C2_RX_FIFO_SIZE_NUM     2
#elif  (RTE_I2C2_RX_FIFO_SIZE_ID == 2)
#define RTE_I2C2_RX_FIFO_SIZE         FIFO_SIZE_4
#define RTE_I2C2_RX_FIFO_SIZE_NUM     4
#elif  (RTE_I2C2_RX_FIFO_SIZE_ID == 3)
#define RTE_I2C2_RX_FIFO_SIZE         FIFO_SIZE_8
#define RTE_I2C2_RX_FIFO_SIZE_NUM     8
#elif  (RTE_I2C2_RX_FIFO_SIZE_ID == 4)
#define RTE_I2C2_RX_FIFO_SIZE         FIFO_SIZE_16
#define RTE_I2C2_RX_FIFO_SIZE_NUM     16
#elif  (RTE_I2C2_RX_FIFO_SIZE_ID == 5)
#define RTE_I2C2_RX_FIFO_SIZE         FIFO_SIZE_32
#define RTE_I2C2_RX_FIFO_SIZE_NUM     32
#else
#error "Invalid I2C2_RX FIFO SIZE Configuration!"
#endif

//   <o> I2C2_TX FIFO ENTRIES <0=>0 <1=>2 <2=>4 <3=>8 <4=>16 <5=>32
#define RTE_I2C2_TX_FIFO_SIZE_ID                4
#if    (RTE_I2C2_TX_FIFO_SIZE_ID == 0)
#define RTE_I2C2_TX_FIFO_SIZE         NO_FIFO
#define RTE_I2C2_TX_FIFO_SIZE_NUM     0
#elif  (RTE_I2C2_TX_FIFO_SIZE_ID == 1)
#define RTE_I2C2_TX_FIFO_SIZE         FIFO_SIZE_2
#define RTE_I2C2_TX_FIFO_SIZE_NUM     2
#elif  (RTE_I2C2_TX_FIFO_SIZE_ID == 2)
#define RTE_I2C2_TX_FIFO_SIZE         FIFO_SIZE_4
#define RTE_I2C2_TX_FIFO_SIZE_NUM     4
#elif  (RTE_I2C2_TX_FIFO_SIZE_ID == 3)
#define RTE_I2C2_TX_FIFO_SIZE         FIFO_SIZE_8
#define RTE_I2C2_TX_FIFO_SIZE_NUM     8
#elif  (RTE_I2C2_TX_FIFO_SIZE_ID == 4)
#define RTE_I2C2_TX_FIFO_SIZE         FIFO_SIZE_16
#define RTE_I2C2_TX_FIFO_SIZE_NUM     16
#elif  (RTE_I2C2_TX_FIFO_SIZE_ID == 5)
#define RTE_I2C2_TX_FIFO_SIZE         FIFO_SIZE_32
#define RTE_I2C2_TX_FIFO_SIZE_NUM     32
#else
#error "Invalid I2C2_TX FIFO SIZE Configuration!"
#endif

// <o>IRQ Priority <0-3>
// <i> Defines priority of I2C events IRQ handling
// <i> Default: 3
#define RTE_I2C2_IRQ_PRIORITY  3

// <o>Hold Delay <0-15>
// <i> Defines the delay used to respect the SDA hold time
// <i> Default: 0
#define RTE_I2C2_HDEL  0

//</e>
// <e> I2C3 (Serial peripheral interface) [Driver_I2C3]
// <i> Configuration settings for Driver_I2C3 in component ::Drivers:I2C
#define RTE_I2C3                      0

//   <o> I2C3_TX Pin <0=>P0_0 <1=>P0_1 <2=>P2_12 <3=>P2_13 <4=>P3_0
#define RTE_I2C3_TX_ID                0

#if    (RTE_I2C3_TX_ID == 0)
#define RTE_I2C3_TX_PORT              P0_0
#define RTE_I2C3_TX_AF                P0_0_AF_U1C1_DOUT0
#elif  (RTE_I2C3_TX_ID == 1)
#define RTE_I2C3_TX_PORT              P0_1
#define RTE_I2C3_TX_AF                P0_1_AF_U1C1_DOUT0
#elif  (RTE_I2C3_TX_ID == 2)
#define RTE_I2C3_TX_PORT              P2_12
#define RTE_I2C3_TX_AF                P2_12_AF_U1C1_DOUT0
#elif  (RTE_I2C3_TX_ID == 3)
#define RTE_I2C3_TX_PORT              P2_13
#define RTE_I2C3_TX_AF                P2_13_AF_U1C1_DOUT0
#elif  (RTE_I2C3_TX_ID == 4)
#define RTE_I2C3_TX_PORT              P3_0
#define RTE_I2C3_TX_AF                P3_0_AF_U1C1_DOUT0
#else
#error "Invalid I2C3_TX Pin Configuration!"
#endif

//   <o> I2C3_RX Pin <0=>P0_0 <1=>P0_1 <2=>P2_12 <3=>P2_13 <4=>P3_0
#define RTE_I2C3_RX_ID                0

