Infineon/amazon-freertos/vendors/infineon/XMCLib/2.2.0/CMSIS/Driver/Source/Config/XMC1400_Q48/RTE_Device.h
//   <o> I2S1_TX FIFO ENTRIES <0=>0 <1=>2 <2=>4 <3=>8 <4=>16 <5=>32
//   <i> Transmit FIFO size for I2S1
#define RTE_I2S1_TX_FIFO_SIZE_ID                4

#if    (RTE_I2S1_TX_FIFO_SIZE_ID == 0)
#define RTE_I2S1_TX_FIFO_SIZE         NO_FIFO
#define RTE_I2S1_TX_FIFO_SIZE_NUM     0
#elif  (RTE_I2S1_TX_FIFO_SIZE_ID == 1)
#define RTE_I2S1_TX_FIFO_SIZE         FIFO_SIZE_2
#define RTE_I2S1_TX_FIFO_SIZE_NUM     2
#elif  (RTE_I2S1_TX_FIFO_SIZE_ID == 2)
#define RTE_I2S1_TX_FIFO_SIZE         FIFO_SIZE_4
#define RTE_I2S1_TX_FIFO_SIZE_NUM     4
#elif  (RTE_I2S1_TX_FIFO_SIZE_ID == 3)
#define RTE_I2S1_TX_FIFO_SIZE         FIFO_SIZE_8
#define RTE_I2S1_TX_FIFO_SIZE_NUM     8
#elif  (RTE_I2S1_TX_FIFO_SIZE_ID == 4)
#define RTE_I2S1_TX_FIFO_SIZE         FIFO_SIZE_16
#define RTE_I2S1_TX_FIFO_SIZE_NUM     16
#elif  (RTE_I2S1_TX_FIFO_SIZE_ID == 5)
#define RTE_I2S1_TX_FIFO_SIZE         FIFO_SIZE_32
#define RTE_I2S1_TX_FIFO_SIZE_NUM     32
#else
#error "Invalid I2S1_TX FIFO SIZE Configuration!"
#endif

// <o>IRQ Priority <0-3>
// <i> Defines priority of I2S events IRQ handling
// <i> Default: 3
#define RTE_I2S1_IRQ_PRIORITY  3

//</e>

// <e> I2S2 (Inter-Integrated Sound) [Driver_SAI2]
// <i> Configuration settings for Driver_SAI2 in component ::Drivers:SAI
#define RTE_I2S2                      0

//   <o> I2S2_TX Pin <0=>P0_2 <1=>P0_3 <4=>P4_4 <5=>P4_5
//   <i> Transmit data for I2S2
#define RTE_I2S2_TX_ID                0
#if    (RTE_I2S2_TX_ID == 0)
#define RTE_I2S2_TX_PORT              P0_2
#define RTE_I2S2_TX_AF                P0_2_AF_U1C0_DOUT0
#elif  (RTE_I2S2_TX_ID == 1)
#define RTE_I2S2_TX_PORT              P0_3
#define RTE_I2S2_TX_AF                P0_3_AF_U1C0_DOUT0
#elif  (RTE_I2S2_TX_ID == 4)
#define RTE_I2S2_TX_PORT              P4_4
#define RTE_I2S2_TX_AF                P4_4_AF_U1C0_DOUT0
#elif  (RTE_I2S2_TX_ID == 5)
#define RTE_I2S2_TX_PORT              P4_5
#define RTE_I2S2_TX_AF                P4_5_AF_U1C0_DOUT0
#else
#error "Invalid I2S2_TX Pin Configuration!"
#endif

//   <o> I2S2_RX Pin <0=>P0_2 <1=>P0_3 <4=>P4_4 <5=>P4_5
//   <i> Receive data for I2S2
#define RTE_I2S2_RX_ID                0
#if    (RTE_I2S2_RX_ID == 0)
#define RTE_I2S2_RX_PORT              P0_2
#define RTE_I2S2_RX_INPUT             USIC1_C0_DX0_P0_2
#elif  (RTE_I2S2_RX_ID == 1)
#define RTE_I2S2_RX_PORT              P0_3
#define RTE_I2S2_RX_INPUT             USIC1_C0_DX0_P0_3
#elif  (RTE_I2S2_RX_ID == 4)
#define RTE_I2S2_RX_PORT              P4_4
#define RTE_I2S2_RX_INPUT             USIC1_C0_DX0_P4_4
#elif  (RTE_I2S2_RX_ID == 5)
#define RTE_I2S2_RX_PORT              P4_5
#define RTE_I2S2_RX_INPUT             USIC1_C0_DX0_P4_5
#else
#error "Invalid I2S2_RX Pin Configuration!"
#endif

//   <o> I2S2_CLK OUTPUT Pin <0=>P0_2 <1=>P2_12 <5=>P4_5 <6=>P4_6
//   <i> Transmit clock for I2S2
#define RTE_I2S2_CLK_OUTPUT_ID                0
#if    (RTE_I2S2_CLK_OUTPUT_ID == 0)
#define RTE_I2S2_CLK_OUTPUT_PORT              P0_2
#define RTE_I2S2_CLK_AF                       P0_2_AF_U1C0_SCLKOUT
#elif  (RTE_I2S2_CLK_OUTPUT_ID == 1)
#define RTE_I2S2_CLK_OUTPUT_PORT              P2_12
#define RTE_I2S2_CLK_AF                       P2_12_AF_U1C0_SCLKOUT
#elif  (RTE_I2S2_CLK_OUTPUT_ID == 5)
#define RTE_I2S2_CLK_OUTPUT_PORT              P4_5
#define RTE_I2S2_CLK_AF                       P4_5_AF_U1C0_SCLKOUT
#elif  (RTE_I2S2_CLK_OUTPUT_ID == 6)
#define RTE_I2S2_CLK_OUTPUT_PORT              P4_6
#define RTE_I2S2_CLK_AF                       P4_6_AF_U1C0_SCLKOUT
#else
#error "Invalid I2S2 CLOCK OUTPUT Pin Configuration!"
#endif

//   <o> I2S2_CLK INPUT Pin <0=>P0_2 <2=>P4_5 <3=>P4_6
//   <i> Receive clock for I2S2
#define RTE_I2S2_CLK_INPUT_ID                0
#if    (RTE_I2S2_CLK_INPUT_ID == 0)
#define RTE_I2S2_CLK_INPUT_PORT              P0_2
#define RTE_I2S2_CLK_INPUT                   USIC1_C0_DX1_P0_2
#elif  (RTE_I2S2_CLK_INPUT_ID == 2)
#define RTE_I2S2_CLK_INPUT_PORT              P4_5
#define RTE_I2S2_CLK_INPUT                   USIC1_C0_DX1_P4_5
#elif  (RTE_I2S2_CLK_INPUT_ID == 3)
#define RTE_I2S2_CLK_INPUT_PORT              P4_6
#define RTE_I2S2_CLK_INPUT                   USIC1_C0_DX1_P4_6
#else
#error "Invalid I2S2 CLOCK INPUT Pin Configuration!"
#endif

//   <o> I2S2_WS OUTPUT Pin <1=>P4_7
//   <i> Transmit word select for I2S2
#define RTE_I2S2_WS_OUTPUT_ID                1
#if   (RTE_I2S2_WS_OUTPUT_ID == 1)
#define RTE_I2S2_WS_OUTPUT_PORT              P4_7
#define RTE_I2S2_WS_AF                       P4_7_AF_U1C0_SELO0
#else
#error "Invalid I2S2_WS Output Pin Configuration!"
#endif

//   <o> I2S2_WS INPUT Pin <1=>P4_7
#define RTE_I2S2_WS_INPUT_ID                 1
#if  (RTE_I2S2_WS_INPUT_ID == 1)
#define RTE_I2S2_WS_INPUT_PORT               P4_7
#define RTE_I2S2_WS_INPUT_ID_INPUT           USIC1_C0_DX2_P4_7
#else
#error "Invalid I2S2_WS Input Pin Configuration!"
#endif

// <e> Enable MCLK output
#define RTE_I2S2_MCLK_OUTPUT_ENABLE          0
//   <o> I2S0_MCLK OUTPUT Pin <0=>P2_13
#define RTE_I2S2_MCLK_OUTPUT_ID              0
#if    (RTE_I2S2_MCLK_OUTPUT_ID == 0)
#define RTE_I2S2_MCLK_OUTPUT_PORT            P2_13
#define RTE_I2S2_MCLK_AF                     P2_13_AF_U1C0_MCLKOUT
#else
#error "Invalid I2S2_MCLK Output Pin Configuration!"
#endif
// </e>

//   <o> I2S2_RX FIFO ENTRIES <0=>0 <1=>2 <2=>4 <3=>8 <4=>16 <5=>32
//   <i> Receive FIFO size for I2S2
#define RTE_I2S2_RX_FIFO_SIZE_ID                4
#if    (RTE_I2S2_RX_FIFO_SIZE_ID == 0)
#define RTE_I2S2_RX_FIFO_SIZE         NO_FIFO
#define RTE_I2S2_RX_FIFO_SIZE_NUM     0
#elif  (RTE_I2S2_RX_FIFO_SIZE_ID == 1)
#define RTE_I2S2_RX_FIFO_SIZE         FIFO_SIZE_2
#define RTE_I2S2_RX_FIFO_SIZE_NUM     2
#elif  (RTE_I2S2_RX_FIFO_SIZE_ID == 2)
#define RTE_I2S2_RX_FIFO_SIZE         FIFO_SIZE_4
#define RTE_I2S2_RX_FIFO_SIZE_NUM     4
#elif  (RTE_I2S2_RX_FIFO_SIZE_ID == 3)
#define RTE_I2S2_RX_FIFO_SIZE         FIFO_SIZE_8
#define RTE_I2S2_RX_FIFO_SIZE_NUM     8
#elif  (RTE_I2S2_RX_FIFO_SIZE_ID == 4)
#define RTE_I2S2_RX_FIFO_SIZE         FIFO_SIZE_16
#define RTE_I2S2_RX_FIFO_SIZE_NUM     16
#elif  (RTE_I2S2_RX_FIFO_SIZE_ID == 5)
#define RTE_I2S2_RX_FIFO_SIZE         FIFO_SIZE_32
#define RTE_I2S2_RX_FIFO_SIZE_NUM     32
#else
#error "Invalid I2S2_RX FIFO SIZE Configuration!"
#endif

