Infineon/amazon-freertos/vendors/infineon/XMCLib/2.2.0/CMSIS/Driver/Source/Config/XMC1400_Q48/RTE_Device.h
//   <o> I2S2_TX FIFO ENTRIES <0=>0 <1=>2 <2=>4 <3=>8 <4=>16 <5=>32
//   <i> Transmit FIFO size for I2S2
#define RTE_I2S2_TX_FIFO_SIZE_ID                4
#if    (RTE_I2S2_TX_FIFO_SIZE_ID == 0)
#define RTE_I2S2_TX_FIFO_SIZE         NO_FIFO
#define RTE_I2S2_TX_FIFO_SIZE_NUM     0
#elif  (RTE_I2S2_TX_FIFO_SIZE_ID == 1)
#define RTE_I2S2_TX_FIFO_SIZE         FIFO_SIZE_2
#define RTE_I2S2_TX_FIFO_SIZE_NUM     2
#elif  (RTE_I2S2_TX_FIFO_SIZE_ID == 2)
#define RTE_I2S2_TX_FIFO_SIZE         FIFO_SIZE_4
#define RTE_I2S2_TX_FIFO_SIZE_NUM     4
#elif  (RTE_I2S2_TX_FIFO_SIZE_ID == 3)
#define RTE_I2S2_TX_FIFO_SIZE         FIFO_SIZE_8
#define RTE_I2S2_TX_FIFO_SIZE_NUM     8
#elif  (RTE_I2S2_TX_FIFO_SIZE_ID == 4)
#define RTE_I2S2_TX_FIFO_SIZE         FIFO_SIZE_16
#define RTE_I2S2_TX_FIFO_SIZE_NUM     16
#elif  (RTE_I2S2_TX_FIFO_SIZE_ID == 5)
#define RTE_I2S2_TX_FIFO_SIZE         FIFO_SIZE_32
#define RTE_I2S2_TX_FIFO_SIZE_NUM     32
#else
#error "Invalid I2S2_TX FIFO SIZE Configuration!"
#endif

// <o>IRQ Priority <0-3>
// <i> Defines priority of I2S events IRQ handling
// <i> Default: 3
#define RTE_I2S2_IRQ_PRIORITY  3

//</e>

// <e> I2S3 (Inter-Integrated Sound) [Driver_SAI3]
// <i> Configuration settings for Driver_SAI3 in component ::Drivers:SAI
#define RTE_I2S3                      0

//   <o> I2S3_TX Pin <0=>P0_0 <1=>P0_1 <2=>P2_12 <3=>P2_13 <4=>P3_0
//   <i> Transmit data for I2S3
#define RTE_I2S3_TX_ID                0
#if    (RTE_I2S3_TX_ID == 0)
#define RTE_I2S3_TX_PORT              P0_0
#define RTE_I2S3_TX_AF                P0_0_AF_U1C1_DOUT0
#elif  (RTE_I2S3_TX_ID == 1)
#define RTE_I2S3_TX_PORT              P0_1
#define RTE_I2S3_TX_AF                P0_1_AF_U1C1_DOUT0
#elif  (RTE_I2S3_TX_ID == 2)
#define RTE_I2S3_TX_PORT              P2_12
#define RTE_I2S3_TX_AF                P2_12_AF_U1C1_DOUT0
#elif  (RTE_I2S3_TX_ID == 3)
#define RTE_I2S3_TX_PORT              P2_13
#define RTE_I2S3_TX_AF                P2_13_AF_U1C1_DOUT0
#elif  (RTE_I2S3_TX_ID == 4)
#define RTE_I2S3_TX_PORT              P3_0
#define RTE_I2S3_TX_AF                P3_0_AF_U1C1_DOUT0
#else
#error "Invalid I2S3_TX Pin Configuration!"
#endif

//   <o> I2S3_RX Pin <0=>P0_0 <1=>P0_1 <2=>P2_12 <3=>P2_13 <4=>P3_0
//   <i> Receive data for I2S3
#define RTE_I2S3_RX_ID                0
#if    (RTE_I2S3_RX_ID == 0)
#define RTE_I2S3_RX_PORT              P0_0
#define RTE_I2S3_RX_INPUT             USIC1_C1_DX0_P0_0
#elif  (RTE_I2S3_RX_ID == 1)
#define RTE_I2S3_RX_PORT              P0_1
#define RTE_I2S3_RX_INPUT             USIC1_C1_DX0_P0_1
#elif  (RTE_I2S3_RX_ID == 2)
#define RTE_I2S3_RX_PORT              P2_12
#define RTE_I2S3_RX_INPUT             USIC1_C1_DX0_P2_12
#elif  (RTE_I2S3_RX_ID == 3)
#define RTE_I2S3_RX_PORT              P2_13
#define RTE_I2S3_RX_INPUT             USIC1_C1_DX0_P2_13
#elif  (RTE_I2S3_RX_ID == 4)
#define RTE_I2S3_RX_PORT              P3_0
#define RTE_I2S3_RX_INPUT             USIC1_C1_DX0_P3_0
#else
#error "Invalid I2S3_RX Pin Configuration!"
#endif

//   <o> I2S3_CLK OUTPUT Pin <0=>P0_1 <1=>P0_3 <3=>P2_12 <4=>P3_0
//   <i> Transmit clock for I2S3
#define RTE_I2S3_CLK_OUTPUT_ID                0
#if    (RTE_I2S3_CLK_OUTPUT_ID == 0)
#define RTE_I2S3_CLK_OUTPUT_PORT              P0_1
#define RTE_I2S3_CLK_AF                       P0_1_AF_U1C1_SCLKOUT
#elif  (RTE_I2S3_CLK_OUTPUT_ID == 1)
#define RTE_I2S3_CLK_OUTPUT_PORT              P0_3
#define RTE_I2S3_CLK_AF                       P0_3_AF_U1C1_SCLKOUT
#elif  (RTE_I2S3_CLK_OUTPUT_ID == 3)
#define RTE_I2S3_CLK_OUTPUT_PORT              P2_12
#define RTE_I2S3_CLK_AF                       P2_12_AF_U1C1_SCLKOUT
#elif  (RTE_I2S3_CLK_OUTPUT_ID == 4)
#define RTE_I2S3_CLK_OUTPUT_PORT              P3_0
#define RTE_I2S3_CLK_AF                       P3_0_AF_U1C1_SCLKOUT
#else
#error "Invalid I2S3 CLOCK OUTPUT Pin Configuration!"
#endif

//   <o> I2S3_CLK INPUT Pin <0=>P0_1 <2=>P2_12 <3=>P3_0
//   <i> Receive clock for I2S3
#define RTE_I2S3_CLK_INPUT_ID                0
#if    (RTE_I2S3_CLK_INPUT_ID == 0)
#define RTE_I2S3_CLK_INPUT_PORT              P0_1
#define RTE_I2S3_CLK_INPUT                   USIC1_C1_DX1_P0_1
#elif  (RTE_I2S3_CLK_INPUT_ID == 2)
#define RTE_I2S3_CLK_INPUT_PORT              P2_12
#define RTE_I2S3_CLK_INPUT                   USIC1_C1_DX1_P2_12
#elif  (RTE_I2S3_CLK_INPUT_ID == 3)
#define RTE_I2S3_CLK_INPUT_PORT              P3_0
#define RTE_I2S3_CLK_INPUT                   USIC1_C1_DX1_P3_0
#else
#error "Invalid I2S3 CLOCK INPUT Pin Configuration!"
#endif

//   <o> I2S3_WS OUTPUT Pin <0=>P0_4
//   <i> Transmit word select for I2S3
#define RTE_I2S3_WS_OUTPUT_ID                0
#if     (RTE_I2S3_WS_OUTPUT_ID == 0)
#define RTE_I2S3_WS_OUTPUT_PORT              P0_4
#define RTE_I2S3_WS_AF                       P0_4_AF_U1C1_SELO0
#else
#error "Invalid I2S3_WS Output Pin Configuration!"
#endif

#define RTE_I2S3_WS_INPUT_ID                 -1

#define RTE_I2S3_MCLK_OUTPUT_ENABLE          0

//   <o> I2S3_RX FIFO ENTRIES <0=>0 <1=>2 <2=>4 <3=>8 <4=>16 <5=>32
//   <i> Receive FIFO size for I2S3
#define RTE_I2S3_RX_FIFO_SIZE_ID                4
#if    (RTE_I2S3_RX_FIFO_SIZE_ID == 0)
#define RTE_I2S3_RX_FIFO_SIZE         NO_FIFO
#define RTE_I2S3_RX_FIFO_SIZE_NUM     0
#elif  (RTE_I2S3_RX_FIFO_SIZE_ID == 1)
#define RTE_I2S3_RX_FIFO_SIZE         FIFO_SIZE_2
#define RTE_I2S3_RX_FIFO_SIZE_NUM     2
#elif  (RTE_I2S3_RX_FIFO_SIZE_ID == 2)
#define RTE_I2S3_RX_FIFO_SIZE         FIFO_SIZE_4
#define RTE_I2S3_RX_FIFO_SIZE_NUM     4
#elif  (RTE_I2S3_RX_FIFO_SIZE_ID == 3)
#define RTE_I2S3_RX_FIFO_SIZE         FIFO_SIZE_8
#define RTE_I2S3_RX_FIFO_SIZE_NUM     8
#elif  (RTE_I2S3_RX_FIFO_SIZE_ID == 4)
#define RTE_I2S3_RX_FIFO_SIZE         FIFO_SIZE_16
#define RTE_I2S3_RX_FIFO_SIZE_NUM     16
#elif  (RTE_I2S3_RX_FIFO_SIZE_ID == 5)
#define RTE_I2S3_RX_FIFO_SIZE         FIFO_SIZE_32
#define RTE_I2S3_RX_FIFO_SIZE_NUM     32
#else
#error "Invalid I2S3_RX FIFO SIZE Configuration!"
#endif

//   <o> I2S3_TX FIFO ENTRIES <0=>0 <1=>2 <2=>4 <3=>8 <4=>16 <5=>32
//   <i> Transmit FIFO size for I2S3
#define RTE_I2S3_TX_FIFO_SIZE_ID                4
#if    (RTE_I2S3_TX_FIFO_SIZE_ID == 0)
#define RTE_I2S3_TX_FIFO_SIZE         NO_FIFO
#define RTE_I2S3_TX_FIFO_SIZE_NUM     0
#elif  (RTE_I2S3_TX_FIFO_SIZE_ID == 1)
#define RTE_I2S3_TX_FIFO_SIZE         FIFO_SIZE_2
#define RTE_I2S3_TX_FIFO_SIZE_NUM     2
#elif  (RTE_I2S3_TX_FIFO_SIZE_ID == 2)
#define RTE_I2S3_TX_FIFO_SIZE         FIFO_SIZE_4
#define RTE_I2S3_TX_FIFO_SIZE_NUM     4
#elif  (RTE_I2S3_TX_FIFO_SIZE_ID == 3)
#define RTE_I2S3_TX_FIFO_SIZE         FIFO_SIZE_8
#define RTE_I2S3_TX_FIFO_SIZE_NUM     8
#elif  (RTE_I2S3_TX_FIFO_SIZE_ID == 4)
#define RTE_I2S3_TX_FIFO_SIZE         FIFO_SIZE_16
#define RTE_I2S3_TX_FIFO_SIZE_NUM     16
#elif  (RTE_I2S3_TX_FIFO_SIZE_ID == 5)
#define RTE_I2S3_TX_FIFO_SIZE         FIFO_SIZE_32
#define RTE_I2S3_TX_FIFO_SIZE_NUM     32
#else
#error "Invalid I2S3_TX FIFO SIZE Configuration!"
#endif

